%--------------------------------------------------------------------------
%   逗留相位原理产生非线性调频信号
%   qwe14789cn@gmail.com
%   20180308
%--------------------------------------------------------------------------
%   初始化
%--------------------------------------------------------------------------
clear;
clc;

%--------------------------------------------------------------------------
%   参数设置
%--------------------------------------------------------------------------
%   构造连续信号的Fs
%--------------------------------------------------------------------------
fs = 70e6;                                                                 %发射信号采样频率

%--------------------------------------------------------------------------
bw = 3e6;                                                                   %发射信号带宽
k = 0.09;
K = (1-k)/(1+k)/2;
PRT = 162e-6;
%--------------------------------------------------------------------------
%   长脉冲参数设置
%--------------------------------------------------------------------------
Tp1 = 30e-6;                                                                 %发射信号脉冲宽度
t1  = -0.5*Tp1 : 1/fs : 0.5 * Tp1 - 1/fs;                                       %采样点长度
N1  = length(t1);
f1  = linspace(-bw/2,bw/2,N1);

%--------------------------------------------------------------------------
%   短脉冲参数设置
%--------------------------------------------------------------------------
Tp2 = 2e-6;                                                                 %发射信号脉冲宽度
t2  = -0.5*Tp2 : 1/fs : 0.5 * Tp2 - 1/fs;                                   %采样点长度
N2  = length(t2);
f2  = linspace(-bw/2,bw/2,N2);

%--------------------------------------------------------------------------
%   核心是这个t的数学公式，是频域表达式积分出来的，这才是重点
%   如何用模糊函数制定这个函数形态
%--------------------------------------------------------------------------
tf1 = f1/bw*Tp1 + K*Tp1 * sin(2*pi*f1/bw)/pi;                               %这个应该是群时延函数
tf2 = f2/bw*Tp2 + K*Tp2 * sin(2*pi*(f2/bw))/pi;                             %这个应该是群时延函数
% 
%--------------------------------------------------------------------------
%   理由解释
%   这里是等间距频率轴，时间轴不是等间距的，所以要把数据变成等间距时间轴
%   因此要进行差值
%--------------------------------------------------------------------------
ft1 = interp1(tf1,f1,t1);                                                   %对这个函数按照t0坐标系差值
ft2 = interp1(tf2,f2,t2);                                                   %对这个函数按照t0坐标系差值

%--------------------------------------------------------------------------
%   cumtrapz 梯形法求解数值积分
%--------------------------------------------------------------------------
phi1 = 2*pi*cumtrapz(ft1)/fs;
sig1 = exp(1j*phi1).';
phi2 = 2*pi*cumtrapz(ft2)/fs;
sig2 = exp(-1j*phi2).';

sig = [sig1;sig2;zeros(round((PRT-Tp1-Tp2)*fs),1)];


%--------------------------------------------------------------------------
%   可视化
%--------------------------------------------------------------------------
figure(1)
subplot(321)
plot(real(sig1));grid on;
subplot(322)
spectrogram(sig1,128,127,128,fs,'yaxis');
subplot(323)
plot(real(sig2));grid on;
subplot(324)
spectrogram(sig2,16,15,16,fs,'yaxis');
subplot(325)
plot(real(sig));grid on;
subplot(326)
spectrogram(sig,64,63,128,fs,'yaxis');

figure(2)
subplot(311)
plot(0:1/fs:PRT-1/fs,real(sig));title('长+短脉冲合成');grid on
subplot(312)
plot(t1,real(sig1));title('长脉冲');grid on
subplot(313)
plot(t2,real(sig2));title('短脉冲');grid on

fprintf('按照采样率 %d MHz 生成的连续信号->raw_signal\n',fs/1e6)
save P01_waveform.mat sig1 sig2 sig fs bw PRT Tp1 Tp2
