%--------------------------------------------------------------------------
%   遗传算法学习
%   根据目标函数计算函数最小值
%--------------------------------------------------------------------------
clear;clc;close all;

%--------------------------------------------------------------------------
%   构造目标函数
%--------------------------------------------------------------------------
func = @(x)x + 10*cos(5*x) + 7 * sin(4*x);

% x = 0:0.01:10;
% y = func(x);
% % figure(1)
% % plot(x,y);grid on;xlabel('x');ylabel('f(x)')
% title('f(x) = x+10cos(5x)+7sin(4x)')

%--------------------------------------------------------------------------
disp('参数设置')
%--------------------------------------------------------------------------
NP = 50;                                                                    %种群规模
L  = 20;                                                                    %二进制串长度
Pc = 0.8;                                                                   %交叉率
Pm = 0.05;                                                                  %变异率
G  = 100;                                                                   %最大遗传代数
Xs = 10;                                                                    %上限
Xx = 0;                                                                     %下限

group_bin  = randi([0 1],NP,L);                                             %随机获得初始二进制种群
group_dec = Xx+(Xs-Xx)*bin2dec(num2str(group_bin))./(2^L-1);                %缩放到数值范围区域后的初始种群

Fit = func(group_dec);                                                      %各个种群参数落在函数上的值

max_fit = max(Fit);
min_fit = min(Fit);

rr = find(Fit == min_fit);                                                  %找到种群
rr
group_dec(rr)
func(group_dec(rr))



















